# ValueAtPoint Constructor (ValueAtPoint) (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ValueAtPoint Constructor (ValueAtPoint)
ValueAtPoint Class See Also
---
Creates a copy of the given ValueAtPoint instance.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public ValueAtPoint(
	ValueAtPoint otherObject
)
```

Visual Basic
---
```text
Public Sub New ( _
	otherObject As ValueAtPoint _
)
```

Visual C++
---
```text
public:
ValueAtPoint(
	ValueAtPoint^ otherObject
)
```

# ### Parameters
otherObject
    Type: Autodesk.Revit.DB.Analysis..::..ValueAtPoint
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
ValueAtPoint Class
ValueAtPoint Overload
Autodesk.Revit.DB.Analysis Namespace